#131 is also failing:

```shell
benpro on chiisai in ~/Devel/incus via 💠 default 
at 05:38:00 ❯ cat ~/.tofurc
provider_installation {
  dev_overrides {
    "lxc/incus" = "/home/benpro/Devel/terraform-provider-incus"
  }
}
```

```hcl
resource "incus_storage_volume" "forgejo_var_lib_forgejo" {
  name = "forgejo_var_lib_forgejo"
  pool = incus_storage_pool.default.name
}

data "incus_image" "forgejo" {
  name = "forgejo-8.0.1-1benoitjpnet"
  remote = "laminar.incus"
}

resource "incus_instance" "forgejo" {
  name  = "forgejo"
  #image = "laminar.incus:forgejo-8.0.1-1benoitjpnet"
  image = "data.incus_image.forgejo.fingerprint"

  device {
    name = "var_lib_forgejo"
    type = "disk"
    properties = {
      path   = "/var/lib/forgejo"
      source = incus_storage_volume.forgejo_var_lib_forgejo.name
      pool   = incus_storage_pool.default.name
    }
  }
}
```

```
tofu apply
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - lxc/incus in /home/benpro/Devel/terraform-provider-incus
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵
incus_storage_pool.default: Refreshing state... [name=default]
data.incus_image.forgejo: Reading...
incus_storage_volume.forgejo_var_lib_forgejo: Refreshing state... [name=forgejo_var_lib_forgejo]
incus_storage_volume.laminar_var_lib_incus: Refreshing state... [name=laminar_var_lib_incus]
incus_storage_volume.laminar_var_lib_laminar: Refreshing state... [name=laminar_var_lib_laminar]
incus_instance.laminar: Refreshing state... [name=laminar]

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu planned the following actions, but then encountered a problem:

  # incus_instance.forgejo will be created
  + resource "incus_instance" "forgejo" {
      + config           = {}
      + ephemeral        = false
      + image            = "data.incus_image.forgejo.fingerprint"
      + ipv4_address     = (known after apply)
      + ipv6_address     = (known after apply)
      + limits           = {}
      + mac_address      = (known after apply)
      + name             = "forgejo"
      + profiles         = [
          + "default",
        ]
      + running          = true
      + status           = (known after apply)
      + target           = (known after apply)
      + type             = "container"
      + wait_for_network = true

      + device {
          + name       = "var_lib_forgejo"
          + properties = {
              + "path"   = "/var/lib/forgejo"
              + "pool"   = "default"
              + "source" = "forgejo_var_lib_forgejo"
            }
          + type       = "disk"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: Failed to retrieve Incus ImageServer
│ 
│   with data.incus_image.forgejo,
│   on forgejo.tf line 6, in data "incus_image" "forgejo":
│    6: data "incus_image" "forgejo" {
│ 
│ The remote isn't a private server

```